package basic

type ClassImages struct {
	IMG1 string
	IMG2 string
	IMG3 string
	IMG4 string
	IMG5 string
}

var MageImage = ClassImages{
	"༼つಠ益ಠ༽つ ─=*✧",
	"༼つಠ益ಠ༽つ  ─=*✧",
	"༼つಠ益ಠ༽つ   ─=*✧",
	"༼つಠ益ಠ༽つ    ─=*✧",
	"༼つಠ益ಠ༽つ     ─=*✧"}

var KnightImage = ClassImages{
	"╰༼.◕ヮ◕.༽つ¤=[]:::::::>",
	"  ╰༼.◕ヮ◕.༽つ¤=[]:::::::>",
	"    ╰༼.◕ヮ◕.༽つ¤=[]:::::::>",
	"   ╰༼.◕ヮ◕.༽つ¤=[]:::::::>",
	" ╰༼.◕ヮ◕.༽つ¤=[]:::::::>"}

var TheafImage = ClassImages{
	"╰༼⇀︿⇀༽つ",
	" ╰༼⇀︿⇀༽つ-═──",
	"  ╰༼⇀︿⇀༽つ|",
	" ╰༼⇀︿⇀༽つ-═──",
	"╰༼⇀︿⇀༽つ|"}

var DeathImage = ClassImages{
	"୧༼ X_0 ༽୨ ",
	"୧༼ 0_x ༽୨",
	"୧༼ X_0 ༽୨",
	"୧༼ 0_x ༽୨",
	"୧༼ X_X ༽୨"}

var WarriorImage = ClassImages{
	"(╬ಠ益ಠ)--%",
	"(╬ಠ益ಠ)/%",
	"(╬ಠ益ಠ) --%",
	"(╬ಠ益ಠ) /%",
	"(╬ಠ益ಠ)"}

///////////////////////////////////////////////
//  ─=≡Σ(((༼つಠ益ಠ༽つ рывок
//  ┻━┻ ヘ╰( •̀ε•́ ╰)  проигрыш
//
//
//
//
//
//
//
//////////////////////////////////////////////
